axis=0与axis=1关系：

当做drop等运算时候，0表示行，1表示列；

当做sum或apply运算的时候，0表示列，1表示行；

同时，axis=0与axis=rows一致；axis=1与axis=columns一致。

另一种常见的数据形式是嵌套字典:

如果嵌套字典传给 DataFrame,pandas 就会被解释为:外层字典的键作为列,
内层键则作为行索引:

In [3]:
import pandas as pd
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [4]:
fram = pd.DataFrame(pop)

In [6]:
fram

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [7]:
；# 删除某一列操作
del fram['Ohio']

In [8]:
fram

      Nevada
2000     NaN
2001     2.4
2002     2.9

In [9]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [11]:
obj

a    0
b    1
c    2
dtype: int64

**pandas 对象的一个重要方法是 reindex,其作用是创建一个新对象,它的数据
符合新的索引。**

In [15]:
obj.reindex([1,2,3])
obj

a    0
b    1
c    2
dtype: int64

## 丢弃指定轴上的项

丢弃某条轴上的一个或多个项很简单,只要有一个索引数组或列表即可。由于
需要执行一些数据整理和集合逻辑,所以 drop 方法返回的是一个在指定轴上删
除了指定值的新对象:

In [19]:
import numpy as np
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd','e'])

In [20]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [21]:
new_obj = obj.drop('c')

In [22]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [23]:
new_obj = obj.drop(['a','c'])

In [24]:
new_obj

b    1.0
d    3.0
e    4.0
dtype: float64

In [25]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'NewYork'],columns=['one', 'two', 'three','four'])

In [26]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [29]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NewYork    12     14    15

In [35]:
data.drop('two',axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NewYork    12     14    15

In [36]:
data.drop('Ohio',axis='rows')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [37]:
data.drop('Ohio',axis=0)

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

## 索引方式

### 轴标签(loc)和整数(iloc)索引

In [40]:
data.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [42]:
data.loc['Colorado',['two','four']]

two     5
four    7
Name: Colorado, dtype: int64

In [44]:
data.iloc[2,[0,1]]

one    8
two    9
Name: Utah, dtype: int64

In [46]:
data.loc[:'Utah']

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [47]:
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [48]:
data.iloc[:,:]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [50]:
data.iloc[:3,:3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10

## 函数应用和映射

In [53]:
frame = pd.DataFrame(np.random.randn(4, 3),columns=list('bde'),index=['Utah', 'Ohio', 'Texas',
'Oregon'])

In [54]:
frame

               b         d         e
Utah    0.385468  0.908614 -0.860115
Ohio    0.625719 -0.828135  0.408131
Texas   0.420619 -0.485853  0.127959
Oregon  0.325178 -0.188509 -0.230931

### 直接使用函数

In [56]:
np.abs(frame)

               b         d         e
Utah    0.385468  0.908614  0.860115
Ohio    0.625719  0.828135  0.408131
Texas   0.420619  0.485853  0.127959
Oregon  0.325178  0.188509  0.230931

### apply方法

In [62]:
f = lambda x: x.max() - x.min()
frame

               b         d         e
Utah    0.385468  0.908614 -0.860115
Ohio    0.625719 -0.828135  0.408131
Texas   0.420619 -0.485853  0.127959
Oregon  0.325178 -0.188509 -0.230931

In [65]:
frame.apply(f,axis=1)

Utah      1.768730
Ohio      1.453855
Texas     0.906472
Oregon    0.556109
dtype: float64

In [69]:
frame.apply(f,axis='columns')

Utah      1.768730
Ohio      1.453855
Texas     0.906472
Oregon    0.556109
dtype: float64

In [71]:
format = lambda x: '%.2f' % x

In [75]:
# 之所以叫做 applymap,是因为 Series 有一个用于应用元素级函数的 map 方法
frame.applymap(format)

           b      d      e
Utah    0.39   0.91  -0.86
Ohio    0.63  -0.83   0.41
Texas   0.42  -0.49   0.13
Oregon  0.33  -0.19  -0.23

In [76]:
frame['e'].map(format)

Utah      -0.86
Ohio       0.41
Texas      0.13
Oregon    -0.23
Name: e, dtype: object

### 排序和排名

In [77]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [78]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [86]:
# 降序
obj.sort_index(ascending=False)

d    0
c    3
b    2
a    1
dtype: int64

In [80]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

当排序一个 DataFrame 时,你可能希望根据一个或多个列中的值进行排序。将一个或多个列的名字传递给 sort_values 的 by 选项即可达到该目的

In [87]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [88]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [90]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [93]:
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

默认情况下,rank 是通过“为各组分配一个平均排名”的方式破坏平级关系的

In [103]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [95]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [98]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [99]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [105]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

method有以下5种：

'average':默认，在相等分组中，为各个值分配平均排名
    
'min': 使用整个分组的最小排名
    
'max': 使用整个分组的最大排名
    
'first': 按值在原始数据中的出现顺序分配排名
    
'dense': 类似于'min'方法，但是排名总是在组间增加1，而不是组中相同的元素数

### 带有重复标签的轴索引

In [108]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [109]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [111]:
obj.index.is_unique

False

对于带有重复值的索引,数据选取的行为将会有些不同。如果某个索引对应多个值,则返回一个Series;而对应单个值的,则返回一个标量值:

In [112]:
obj['a']

a    0
a    1
dtype: int64

In [113]:
obj['c']

4

### 汇总和计算描述统计

In [115]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [116]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [117]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [118]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA值会自动被排除,除非整个切片(这里指的是行或列)都是NA。

通过skipna 选项可以禁用该功能:默认为True。

In [121]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

有些方法(如 idxmin 和 idxmax)返回的是间接统计(比如达到最小值或最大值的索引):

In [122]:
df.idxmax()

one    b
two    d
dtype: object

另一些方法则是累计型的:

In [124]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

还有一种方法,它既不是约简型也不是累计型。describe 就是一个例子,它用于一次性产生多个汇总统计:

In [126]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

对于非数值型数据,describe 会产生另外一种汇总统计:

In [127]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [128]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [129]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### 相关系数与协方差

In [130]:
import pandas_datareader.data as web
all_data = {ticker:web.get_data_yahoo(ticker) for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [132]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})

In [133]:
volume = pd.DataFrame({ticker: data['Volume']for ticker, data in all_data.items()})

In [138]:
returns = price.pct_change()

In [139]:
returns

                AAPL      GOOG       IBM      MSFT
Date
2009-12-31       NaN       NaN       NaN       NaN
2010-01-04  0.015565  0.010920  0.011841  0.015420
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023279 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
2010-01-11 -0.008822 -0.001512 -0.010470 -0.012720
2010-01-12 -0.011375 -0.017684  0.007955 -0.006607
2010-01-13  0.014106 -0.005741 -0.002146  0.009312
2010-01-14 -0.005791  0.004701  0.015972  0.020099
2010-01-15 -0.016712 -0.016699 -0.004006 -0.003230
2010-01-19  0.044238  0.013138  0.017909  0.007777
2010-01-20 -0.015392 -0.012270 -0.028999 -0.016399
2010-01-21 -0.017286  0.004428 -0.009597 -0.018960
2010-01-22 -0.049599 -0.056554 -0.027132 -0.034988
2010-01-25  0.026903 -0.018200  0.004940  0.012431
2010-01-26  0.014133  0.004481 -0.002934  0.006139
2010-01-27  0.009420 -0.000590  0.004612  0.005763
2010-01-28 -0.041322 -0.014407 -0.020423 -0.017190
2010-01-29 -0.036279 -0.008142 -0.010990 -0.033608
2010-02-01  0.013902  0.005812  0.018629  0.008162
2010-02-02  0.005803 -0.003565  0.006898  0.001760
2010-02-03  0.017206  0.018263  0.001036  0.005973
2010-02-04 -0.036038 -0.025961 -0.021168 -0.027593
2010-02-05  0.017756  0.008562  0.004228  0.006466
2010-02-08 -0.006856  0.004103 -0.008864 -0.010707
2010-02-09  0.010663  0.005567  0.010912  0.010462
2010-02-10 -0.005454 -0.003710 -0.003247 -0.000714
2010-02-11  0.018194  0.003649  0.007491  0.004645
2010-02-12  0.008607 -0.006115  0.002182 -0.006757
...              ...       ...       ...       ...
2018-12-19 -0.031192 -0.005541 -0.001886 -0.002693
2018-12-20 -0.025235 -0.013294 -0.029288 -0.021024
2018-12-21 -0.038896 -0.029592 -0.018404 -0.032312
2018-12-24 -0.025874 -0.003389 -0.030377 -0.041739
2018-12-26  0.070422  0.064780  0.035512  0.068310
2018-12-27 -0.006490  0.004252  0.021456  0.006166
2018-12-28  0.000512 -0.006514 -0.006592 -0.007808
2018-12-31  0.009665 -0.001417  0.005662  0.011754
2019-01-02  0.001141  0.009888  0.013548 -0.004430
2019-01-03 -0.099607 -0.028484 -0.019964 -0.036788
2019-01-04  0.042689  0.053786  0.039058  0.046509
2019-01-07 -0.002226 -0.002167  0.007075  0.001275
2019-01-08  0.019063  0.007385  0.014219  0.007251
2019-01-09  0.016982 -0.001505  0.007177  0.014300
2019-01-10  0.003196 -0.004029  0.009114 -0.006426
2019-01-11 -0.009818 -0.012277 -0.002710 -0.007722
2019-01-14 -0.015037 -0.011824 -0.008809 -0.007296
2019-01-15  0.020467  0.031071  0.011131  0.029005
2019-01-16  0.012217  0.003546 -0.000904  0.003523
2019-01-17  0.005938  0.008261  0.004687  0.007022
2019-01-18  0.006159  0.007670  0.013340  0.014983
2019-01-22 -0.022446 -0.025258 -0.010499 -0.018847
2019-01-23  0.004044  0.004717  0.084639  0.009746
2019-01-24 -0.007926 -0.001553 -0.002709 -0.004779
2019-01-25  0.033137  0.015914  0.010865  0.009134
2019-01-28 -0.009255 -0.019166  0.002239 -0.019502
2019-01-29 -0.010365 -0.008840  0.000447 -0.020365
2019-01-30  0.068335  0.026815  0.000372  0.033417
2019-01-31  0.007201  0.025077  0.000298 -0.018330
2019-02-01  0.000481 -0.005034 -0.002381 -0.015800

[2287 rows x 4 columns]

In [140]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2019-01-28 -0.009255 -0.019166  0.002239 -0.019502
2019-01-29 -0.010365 -0.008840  0.000447 -0.020365
2019-01-30  0.068335  0.026815  0.000372  0.033417
2019-01-31  0.007201  0.025077  0.000298 -0.018330
2019-02-01  0.000481 -0.005034 -0.002381 -0.015800

In [141]:
returns.corr

<bound method DataFrame.corr of                 AAPL      GOOG       IBM      MSFT
Date
2009-12-31       NaN       NaN       NaN       NaN
2010-01-04  0.015565  0.010920  0.011841  0.015420
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023279 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
2010-01-11 -0.008822 -0.001512 -0.010470 -0.012720
2010-01-12 -0.011375 -0.017684  0.007955 -0.006607
2010-01-13  0.014106 -0.005741 -0.002146  0.009312
2010-01-14 -0.005791  0.004701  0.015972  0.020099
2010-01-15 -0.016712 -0.016699 -0.004006 -0.003230
2010-01-19  0.044238  0.013138  0.017909  0.007777
2010-01-20 -0.015392 -0.012270 -0.028999 -0.016399
2010-01-21 -0.017286  0.004428 -0.009597 -0.018960
2010-01-22 -0.049599 -0.056554 -0.027132 -0.034988
2010-01-25  0.026903 -0.018200  0.004940  0.012431
2010-01-26  0.014133  0.004481 -0.002934  0.006139
2010-01-27  0.009420 -0.000590  0.004612  0.005763
2010-01-28 -0.041322 -0.014407 -0.020423 -0.017190
2010-01-29 -0.036279 -0.008142 -0.010990 -0.033608
2010-02-01  0.013902  0.005812  0.018629  0.008162
2010-02-02  0.005803 -0.003565  0.006898  0.001760
2010-02-03  0.017206  0.018263  0.001036  0.005973
2010-02-04 -0.036038 -0.025961 -0.021168 -0.027593
2010-02-05  0.017756  0.008562  0.004228  0.006466
2010-02-08 -0.006856  0.004103 -0.008864 -0.010707
2010-02-09  0.010663  0.005567  0.010912  0.010462
2010-02-10 -0.005454 -0.003710 -0.003247 -0.000714
2010-02-11  0.018194  0.003649  0.007491  0.004645
2010-02-12  0.008607 -0.006115  0.002182 -0.006757
...              ...       ...       ...       ...
2018-12-19 -0.031192 -0.005541 -0.001886 -0.002693
2018-12-20 -0.025235 -0.013294 -0.029288 -0.021024
2018-12-21 -0.038896 -0.029592 -0.018404 -0.032312
2018-12-24 -0.025874 -0.003389 -0.030377 -0.041739
2018-12-26  0.070422  0.064780  0.035512  0.068310
2018-12-27 -0.006490  0.004252  0.021456  0.006166
2018-12-28  0.000512 -0.006514 -0.006592 -0.007808
2018-12-31  0.009665 -0.001417  0.005662  0.011754
2019-01-02  0.001141  0.009888  0.013548 -0.004430
2019-01-03 -0.099607 -0.028484 -0.019964 -0.036788
2019-01-04  0.042689  0.053786  0.039058  0.046509
2019-01-07 -0.002226 -0.002167  0.007075  0.001275
2019-01-08  0.019063  0.007385  0.014219  0.007251
2019-01-09  0.016982 -0.001505  0.007177  0.014300
2019-01-10  0.003196 -0.004029  0.009114 -0.006426
2019-01-11 -0.009818 -0.012277 -0.002710 -0.007722
2019-01-14 -0.015037 -0.011824 -0.008809 -0.007296
2019-01-15  0.020467  0.031071  0.011131  0.029005
2019-01-16  0.012217  0.003546 -0.000904  0.003523
2019-01-17  0.005938  0.008261  0.004687  0.007022
2019-01-18  0.006159  0.007670  0.013340  0.014983
2019-01-22 -0.022446 -0.025258 -0.010499 -0.018847
2019-01-23  0.004044  0.004717  0.084639  0.009746
2019-01-24 -0.007926 -0.001553 -0.002709 -0.004779
2019-01-25  0.033137  0.015914  0.010865  0.009134
2019-01-28 -0.009255 -0.019166  0.002239 -0.019502
2019-01-29 -0.010365 -0.008840  0.000447 -0.020365
2019-01-30  0.068335  0.026815  0.000372  0.033417
2019-01-31  0.007201  0.025077  0.000298 -0.018330
2019-02-01  0.000481 -0.005034 -0.002381 -0.015800

[2287 rows x 4 columns]>

In [143]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000272  0.000116  0.000076  0.000108
GOOG  0.000116  0.000239  0.000078  0.000121
IBM   0.000076  0.000078  0.000153  0.000088
MSFT  0.000108  0.000121  0.000088  0.000212

In [145]:
returns.corrwith(returns.AAPL)

AAPL    1.000000
GOOG    0.456712
IBM     0.371695
MSFT    0.449642
dtype: float64